CSI API ETABS v1

# cLineElmGetModifiers Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetModifiers(
    	string Name,
    	ref double[] Value
    )

    Function GetModifiers (
    	Name As String,
    	ByRef Value As Double()
    ) As Integer

    Dim instance As cLineElm
    Dim Name As String
    Dim Value As Double()
    Dim returnValue As Integer

    returnValue = instance.GetModifiers(Name,
    	Value)

    int GetModifiers(
    	String^ Name,
    	array<double>^% Value
    )

    abstract GetModifiers :
            Name : string *
            Value : float[] byref -> int

#### Parameters

Name

    Type: SystemString

Value

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cLineElm Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com